Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Allows you to move the mouse cursor around to see the title of the window currently under the cursor.
ja: マウスカーソルを移動して、現在カーソルの下にあるウィンドウのタイトルを見ることができるようにします。

source: Alphabetical Function Index
ja: アルファベット順機能インデックス

source: Alphabetical Function Index | AutoHotkey v2
ja: アルファベット順関数インデックス｜AutoHotkey v2

source: Also excluded:
ja: 同様に除外：

source: Also excluded: ListView, TreeView, ActiveX, Custom.
ja: 同様に除外：ListView、TreeView、ActiveX、Custom。

source: Also known as hotstrings.
ja: ホットストリングスとも呼ばれる。

source: Also makes Click and MouseMove/Click/Drag use the specified method.
ja: また、ClickとMouseMove/Click/Dragは指定されたメソッドを使用するようにします。

source: Also note that handles (including types like HWND and HBITMAP) are essentially pointer-types.
ja: また、ハンドル（HWNDやHBITMAPなどの型も含む）は基本的にポインタ型であることに注意してください。

source: Also note that since there may be up to 2**53 possible values (such as in the range 0.0 to 1.0), the probability of generating exactly the lower bound is generally very low.
ja: また、最大2**53個の可能な値（例えば0.0から1.0の範囲）があるため、下限値を正確に生成する確率は一般に非常に低いことに注意してください。

source: Also note that the pressing of controller buttons always "passes through" to the active window if that window is designed to detect the pressing of controller buttons.
ja: また、コントローラボタンの押下を検出するように設計されているウィンドウでは、コントローラボタンの押下は常にアクティブウィンドウを「通過」することに注意してください。

source: Also note that the pressing of joystick buttons always "passes through" to the active window if that window is designed to detect the pressing of joystick buttons.
ja: また、ジョイスティックボタンの押下を検出するように設計されているウィンドウでは、ジョイスティックボタンの押下は常にアクティブウィンドウに「パススルー」されることに留意してください。

source: Also refer to the following question:
ja: また、次の質問も参考にしてください：

source: Also retrieves joystick status.
ja: ジョイスティックの状態も取得します。

source: Also see ThisHotkey.
ja: ThisHotkeyもご覧ください。

source: Also, Continue may be used to skip the rest of the current iteration, at which time A_Index is increased by 1 and the while-loop's expression is re-evaluated.
ja: また、Continueは、現在の反復の残りをスキップするために使われることもある。その場合、A_Indexは1だけ増加し、whileループの式が再評価される。

source: Also, FormatTime can format the date and/or time according to your locale or preferences.
ja: また、FormatTimeはあなたのロケールや好みに合わせて日付や時刻をフォーマットすることができます。

source: Also, x==y && z:=1 is evaluated as x==y && (z:=1), which short-circuits when x doesn't equal y.
ja: また、x==y && z:=11は、x==y && (z:=1)と評価され、xがyと等しくない場合に短絡する。

source: Also, SendPlay has other limitations described on the SendMode page.
ja: また、SendPlayにはSendModeのページで説明されている他の制限があります。

source: Also, a function may be called without storing its return value:
ja: また、関数は戻り値を保存せずに呼び出すことができます：

source: Also, an individual control can be created with a font color other than the current one by including the C option.
ja: また、Cオプションを含めることで、現在のフォントカラー以外のフォントカラーを持つ個別コントロールを作成することができます。

source: Also, any hotkey with a wildcard prefix (*) is entirely separate from a non-wildcard one; for example, *F1 and F1 would each have their own set of variants.
ja: また、ワイルドカード接頭辞(*)を持つホットキーは、ワイルドカードでないものと全く別物です。例えば、*F1とF1は、それぞれ独自のバリアントセットを持っているでしょう。

source: Also, blank lines or comments may be added between or at the end of any of the lines in the above examples.
ja: また、上記の例の行間や行末に空行やコメントを追加してもよい。

source: Also, check out the Message Tutorial.
ja: また、メッセージ・チュートリアルもご覧ください。

source: Also, for all types of controls, specifying the number of rows via the R option is usually preferable to using H because it prevents a control from showing partial/incomplete rows of text.
ja: また、すべてのタイプのコントロールにおいて、Rオプションで行数を指定すると、テキストの部分的な行や不完全な行が表示されるのを防ぐことができるため、通常はHを使用するよりも好ましいとされています。

source: Also, for each author's protection and ours, we want to make certain that everyone understands that there is no warranty for this free software.
ja: また、各作者の保護と私たちの保護のため、このフリーソフトには保証がないことを皆さんに理解していただきたいと思います。

source: Also, if there is nothing between a pair of delimiters within the input string, the corresponding array element will be blank.
ja: また、入力文字列内の区切り文字の間に何もない場合、対応する配列要素は空白になる。

source: Also, include the string /restart as the first parameter (i.e. after the name of the executable), which tells the program to use the same behavior as Reload.
ja: また、最初のパラメータとして（つまり実行ファイル名の後に）文字列/restartを含めることで、Reloadと同じ動作をするようプログラムに指示します。

source: Also, it is best to not use greater-than or less-than to compare times unless they are both the same string length.
ja: また、時間の比較には、同じ文字列の長さでない限り、大なり小なりは使わないほうがよいでしょう。

source: Also, it is possible to specify both the word Section and XS/YS in a control's options; this uses the previous section for itself but establishes a new section for subsequent controls.
ja: また、コントロールのオプションにSectionという単語とXS/YSの両方を指定することも可能です。この場合、それ自身は前のセクションを使用しますが、後続のコントロールには新しいセクションを確立します。

source: Also, it is possible to specify both the word Section and xs/ys in a control's options; this uses the previous section for itself but establishes a new section for subsequent controls.
ja: また、コントロールのオプションにSectionという単語とxs/ysの両方を指定することも可能です。この場合、それ自身は前のセクションを使用しますが、後続のコントロールには新しいセクションを確立します。

source: Also, it now returns an unsigned value.
ja: また、符号なし値を返すようになりました。

source: Also, it will move the cursor faster depending on how far you push the controller from center.
ja: また、コントローラーを中心からどれだけ離すかによって、カーソルの移動が速くなる。

source: Also, some websites may block such downloads.
ja: また、ウェブサイトによっては、そのようなダウンロードをブロックしている場合があります。

source: Also, the M option might cause some keyboard shortcuts such as Ctrl+← to misbehave while an Input is in progress.
ja: また、Mオプションを使用すると、入力中にCtrl+←などの一部のキーボードショートカットが誤動作する場合があります。

source: Also, the built-in variable A_Now contains the current local time.
ja: また、組み込み変数A_Nowには、現在のローカルタイムが格納されています。

source: Also, the margin is used to determine the horizontal distance that separates auto-positioned controls from each other.
ja: また、マージンは、自動配置されたコントロール同士を隔てる水平方向の距離を決定するために使用されます。

source: Also, the margin is used to determine the vertical distance that separates auto-positioned controls from each other.
ja: また、マージンは、自動配置されたコントロール同士を分離する垂直距離を決定するために使用されます。

source: Also, the operating system offers standard dialog boxes that prompt the user to pick a font, color, or icon.
ja: また、OSには、フォント、色、アイコンの選択を促すダイアログボックスが標準装備されています。

source: Also, the order of modifier symbols such as ^!+# does not matter.
ja: また、^!+#などの修飾記号の順番は関係ありません。

source: Also, the scan code for wheel events is actually the number of notches by which the wheel was turned (typically 1).
ja: また、ホイールイベントのスキャンコードは、実際にはホイールを回したノッチの数（通常は1）です。

source: Also, the special variable A_PriorLine contains the source line immediately preceding the current compiler directive.
ja: また、特殊変数A_PriorLineには、現在のコンパイラ指令の直前のソース行が格納される。

source: Also, the word Disabled may optionally be followed immediately by a 0 or 1 to indicate the starting state (0 for enabled and 1 for disabled).
ja: また、Disabledの直後に0または1を付加して、開始状態（0が有効、1が無効）を示すことも任意に可能です。

source: Also, variable names are not case-sensitive.
ja: また、変数名は大文字と小文字を区別しない。

source: Also, wheel rotation might have no effect in applications such as MS Word and Notepad.
ja: また、MS Wordやメモ帳などのアプリケーションでは、ホイール回転の効果がない場合があります。

source: Also, while the function is in a waiting state, new threads can be launched via hotkey, custom menu item, or timer.
ja: また、機能が待機状態にある間は、ホットキー、カスタムメニュー項目、またはタイマーによって新しいスレッドを起動することができます。

source: Also, with the Send functions you are able to send more than one letter, number or symbol at a time.
ja: また、送信機能を使えば、一度に複数の文字、数字、記号を送信することができます。

source: Also, you can double-click the tray icon to show or hide the keyboard.
ja: また、トレイアイコンをダブルクリックすることで、キーボードの表示・非表示を切り替えることができます。

source: Also, {3} means exactly 3 occurrences, and {3,} means 3 or more occurrences.
ja: また、{3}はちょうど3回、{3,}は3回以上という意味である。

source: Alt-Tab Hotkeys
ja: Alt-Tabのホットキー

source: Alt-Tab hotkeys simplify the mapping of new key combinations to the system's Alt-Tab hotkeys, which are used to invoke a menu for switching tasks (activating windows).
ja: Alt-Tabホットキーは、タスクの切り替え（ウィンドウのアクティブ化）のためのメニューを呼び出すために使用されるシステムのAlt-Tabホットキーに、新しいキーの組み合わせを簡単にマッピングすることができます。

source: Alt-tab issues:
ja: Alt-tabの問題：

source: Alt-tab issues: If you remap a key or mouse button to become Alt, that key will probably not be able to alt-tab properly.
ja: Alt-tabの問題：キーやマウスボタンをAltにリマップした場合、そのキーはおそらくAltタブがうまくできないだろう。

source: Alternatively to example #3 below, a key can also be toggled to its opposite state via the Send function, e.g. Send "{CapsLock}".
ja: また、下記の例3のように、送信機能でキーを反対の状態にすることも可能です：Send "{CapsLock}"。

source: Alternatively to example #3 below, a key can also be toggled to its opposite state via the Send function; for example:
ja: また、下記の例3のように、送信機能でキーを反対の状態にすることも可能です：

source: Alternatively, FileOpen can be used to achieve the same effect.
ja: また、FileOpenを使用しても同様の効果を得ることができます。

source: Alternatively, Thread Interrupt can achieve the same effect as long as it lasts long enough for the function to finish.
ja: また、スレッドインタラプトは、関数が終了するまでの時間が長ければ、同じ効果を得ることができます。

source: Alternatively, ahk_group AltTabWindow can be replaced with the appropriate ahk_class for your system.
ja: あるいは、ahk_group AltTabWindowは、お使いのシステムに適したahk_classに置き換えることができます。

source: Alternatively, a function object, closure or fat arrow function can be used to bind one or more values or variables to the menu item's callback function.
ja: また、関数オブジェクト、クロージャ、ファットアロー関数を使用して、1つ以上の値や変数をメニューアイテムのコールバック関数にバインドすることもできる。

source: Alternatively, a timer can be used to queue up a future thread.
ja: また、タイマーを使って未来のスレッドをキューに入れることも可能です。

source: Alternatively, a numpad key can be made to launch the same subroutine regardless of the state.
ja: また、テンキーは状態に関係なく同じサブルーチンを起動するようにすることもできます。

source: Alternatively, an explicit virtual key code such as vkFF may be specified.
ja: また、vkFFのような明示的な仮想鍵コードを指定することも可能です。

source: Alternatively, append the width, followed by an X, followed by the height; for example:
ja: または、幅の後にXを付け、その後に高さを付けます：

source: Alternatively, append the width, followed by an X, followed by the height; for example: MyGui.Opt("+Resize +MinSize640x480").
ja: または、幅の後にXを付け、その後に高さを付けます：MyGui.Opt("+Resize +MinSize640x480")。

source: Alternatively, if the UIAccess shell verb is registered, it can be used via Run.
ja: あるいは、UIAccessシェル動詞が登録されていれば、Run経由で使用することもできます。

source: Alternatively, if your browser supports it, you can download any of them as a script file by clicking the ↓ button which appears in the top-right of the code block when you hover your mouse over it.
ja: または、ブラウザがサポートしている場合は、マウスをコードブロックの上に置いたときにコードブロックの右上に表示される↓ボタンをクリックして、スクリプトファイルとしてダウンロードできます。

source: Alternatively, one of these letters may be specified:
ja: また、これらの文字のうち1つを指定することもできる：

source: Alternatively, read the QuietUninstallString value from one of the following registry keys, and execute it:
ja: または、以下のレジストリキーのいずれかからQuietUninstallStringの値を読み取り、実行する：

source: Alternatively, the warning can be suppressed by defining a label above the first unreachable line.
ja: また、最初の到達不可能な行の上にラベルを定義することで、警告を抑制することも可能です。

source: Alternatively, this can be an explicit virtual key code such as vkFF, an explicit scan code such as sc01D, or a combination of VK and SC (in that order) such as vk1Bsc001.
ja: あるいは、vkFFのような明示的な仮想キーコード、sc01Dのような明示的なスキャンコード、vk1Bsc001のようなVKとSCの組み合わせ（この順）であっても差し支えありません。

source: Alternatively, to make AltGr itself into a hotkey, use the following hotkey (without any hotkeys like the above present):
ja: また、AltGr自体をホットキーにするには、以下のホットキーを使用します（上記のようなホットキーが存在しない状態）：

source: Alternatively, use Loop Match.Count.
ja: または、LoopMatch.Countを使用します。

source: Alternatively, use an escape sequence.
ja: または、エスケープシーケンスを使用します。

source: Alternatively, use the /install switch described below.
ja: あるいは、後述の/installスイッチを使う。

source: Alternatively, you can click a row once to select it, wait at least half a second, then click the same row again to edit it.
ja: また、行を一度クリックして選択し、半秒以上待ってから同じ行をもう一度クリックすると、編集することができます。

source: Alternatively, you can click an item once to select it, wait at least half a second, then click the same item again to edit it.
ja: あるいは、項目を一度クリックして選択し、少なくとも半秒待ってから同じ項目をもう一度クリックして編集することもできる。

source: Alternatively, you can create a script file (something.ahk) anywhere you like, and run the script file instead of running AutoHotkey.
ja: また、任意の場所にスクリプトファイル（something.ahk）を作成し、AutoHotkeyを起動する代わりにスクリプトファイルを実行することも可能です。

source: Alternatively, you can paste the entire list into a script and then access the name of the current language as demonstrated at the bottom of the list.
ja: あるいは、リスト全体をスクリプトに貼り付けて、リストの一番下に表示されている現在の言語名にアクセスすることもできる。

source: Alternatively, you could translate your remappings into hotkeys (as described below) that explicitly call SendEvent vs. Send.
ja: あるいは、リマッピングをホットキーに変換し（後述）、SendEvent対Sendを明示的に呼び出すこともできる。

source: Although "multi-dimensional" arrays are not supported, a script can combine multiple arrays or maps.
ja: 「多次元」配列はサポートされていないが、スクリプトは複数の配列やマップを組み合わせることができる。

source: Although DetectHiddenWindows, DetectHiddenText and SetTitleMatchMode do not directly affect the behavior of this function, they do affect the other group functions such as GroupActivate and GroupClose.
ja: DetectHiddenWindows、 DetectHiddenText、SetTitleMatchModeは、この関数の動作に直接の影響はありませんがGroupActivateやGroupCloseなど、ほかのグループ関数に影響があります。

source: Although SetTitleMatchMode and DetectHiddenWindows do not directly affect the behavior of this function, they do affect the other group functions such as GroupActivate and GroupClose.
ja: SetTitleMatchModeと DetectHiddenWindowsは、この関数の動作に直接影響しませんが、GroupActivateや GroupCloseなど他のグループ関数に影響します。

source: Although hotkeys also use the symbols ^!+# and the same key names, there are several important differences:
ja: ホットキーも、記号^!+#と同じキー名を使用しますが、いくつかの重要な違いがあります：

source: Although styles and extended styles are also recognized, some of them cannot be applied or removed after a control has been created.
ja: スタイルや拡張スタイルも認識されるが、コントロール作成後に適用・削除できないものもあります。

source: Although NeedleRegEx cannot contain binary zero, the pattern \x00 can be used to match a binary zero within Haystack.
ja: NeedleRegExはバイナリーゼロを含むことができませんが、Haystack内のバイナリーゼロに一致させるために、パターン\x00を使用することができます。

source: Although AutoHotkey does not directly support custom combinations of more than two keys, a similar end result can be achieved by using #HotIf.
ja: AutoHotkeyは2つ以上のキーのカスタムコンビネーションに直接対応していませんが、#HotIfを使用することで同様の最終結果を得ることができます。

source: Although AutoHotkey doesn't actually use multiple threads, it simulates some of that behavior:
ja: AutoHotkeyは実際にはマルチスレッドを使用しませんが、その動作の一部をシミュレートしています：

source: Although AutoHotkey doesn't actually use multiple threads, it simulates some of that behavior: If a second thread is started -- such as by pressing another hotkey while the previous is still running -- the current thread will be interrupted (temporarily halted) to allow the new thread to become current.
ja: AutoHotkeyは実際にはマルチスレッドを使用しませんが、その動作の一部をシミュレートしています：前のスレッドがまだ実行されているときに別のホットキーを押すなどして、2番目のスレッドが開始されると、新しいスレッドが実行できるように、現在のスレッドは中断（一時的に停止）される。

source: Although ComCall supports the Cdecl keyword as per DllCall, it is generally not used by COM interface methods.
ja: ComCallはDllCallと同様にCdeclキーワードをサポートしていますが、一般的にCOMインターフェースメソッドでは使用されません。

source: Although IsSet uses the same syntax as a function call, it may be considered more of an operator than a function.
ja: IsSetは関数呼び出しと同じ構文を使っていますが、関数というより演算子と考えた方がいいかもしれません。

source: Although RegWrite can write directly into a root key, some operating systems might refuse to write into HKEY_CURRENT_USER's top level.
ja: RegWriteはルートキーに直接書き込むことができますが、OSによってはHKEY_CURRENT_USERの最上位に書き込むことを拒否する場合があります。

source: Although SendPlay can send LWin and RWin events, they are sent directly to the active window rather than performing their native operating system function.
ja: SendPlayはLWinとRWinイベントを送ることができますが、それらはオペレーティングシステム本来の機能を果たすのではなく、アクティブウィンドウに直接送られます。

source: Although SendPlay is considerably slower than SendInput, it is usually faster than the traditional SendEvent mode (even when KeyDelay is -1).
ja: SendPlayはSendInputよりかなり遅いですが、通常は従来のSendEventモードより速いです（KeyDelayが-1でも）。

source: Although WinMove cannot move minimized windows, it can move hidden windows if DetectHiddenWindows is on.
ja: WinMoveは最小化されたウィンドウを移動することはできませんが、DetectHiddenWindowsがオンの場合、隠されたウィンドウを移動することができます。

source: Although __Set and property setters can be used, they are not useful since primitive values should be considered immutable.
ja: Setやプロパティ・セッターを使うこともできるが、プリミティブ値は不変であると考えるべきであるので、これらは有用ではない。

source: Although a base object is also generally known as a prototype, we use "a class's Prototype" to mean the object upon which every instance of the class is based, and "base" to mean the object upon which an instance is based.
ja: ベース・オブジェクトは一般にプロトタイプとも呼ばれるが、「クラスのプロトタイプ」はクラスのすべてのインスタンスがベースとするオブジェクトを意味し、「ベース」はインスタンスがベースとするオブジェクトを意味する。

source: Although a controller button or axis can be remapped to become a key or mouse button, it cannot be remapped to some other controller button or axis.
ja: コントローラのボタンや軸をキーやマウスのボタンにリマップすることはできますが、他のコントローラのボタンや軸にリマップすることはできません。

source: Although a delay of -1 (no delay at all) is allowed, it is recommended that at least 0 be used, to increase confidence that the script will run correctly even when the CPU is under load.
ja: 遅延は-1（全く遅延しない）でも可能ですが、CPUに負荷がかかってもスクリプトが正しく動作する信頼性を高めるために、少なくとも0を使用することをお勧めします。

source: Although a function call expression usually begins with a literal function name, the target of the call can be any expression which produces a function object.
ja: 関数呼び出し式は通常、リテラル関数名で始まりますが、呼び出しの対象は、関数オブジェクトを生成する任意の式にすることができます。

source: Although a remapped key can trigger normal hotkeys, by default it cannot trigger mouse hotkeys or hook hotkeys (use ListHotkeys to discover which hotkeys are "hook").
ja: リマップキーは通常のホットキーをトリガーできますが、デフォルトではマウスホットキーやフックホットキーをトリガーすることはできません（どのホットキーが「フック」なのかはListHotkeysを使って調べてください）。

source: Although a value of 1 is allowed, it is not recommended because it would prevent new hotkeys from launching whenever the script is displaying a message box or other dialog.
ja: 1という値も可能ですが、スクリプトがメッセージボックスや、その他のダイアログを表示しているときに、新しいホットキーが起動しなくなるため、お勧めしません。

source: Although a variable is typically thought of as holding a single value, and that value having a distinct type (string, number or object), AutoHotkey automatically converts between numbers and strings in cases like "Value is " myNumber and MsgBox myNumber.
ja: 一般的に変数は1つの値を保持し、その値は明確な型（文字列、数値、オブジェクト）を持つと考えられていますが、AutoHotkeyでは"値は" myNumberやMsgBox myNumberなどの場合、数値と文字列を自動的に変換しています。

source: Although all of these are unusual, WM_CLOSE might be caused by WinClose having been used on the script's main window.
ja: いずれも異常ですが、WM_CLOSEは、スクリプトのメインウィンドウでWinCloseが使用されたことが原因かもしれません。

source: Although an external program may post messages directly to a script's thread via PostThreadMessage() or other API call, this is not recommended because the messages would be lost if the script is displaying a system window such as a message box.
ja: 外部プログラムがPostThreadMessage()などのAPIコールでスクリプトのスレッドに直接メッセージを投稿することもできますが、スクリプトがメッセージボックスなどのシステムウィンドウを表示している場合、メッセージが失われるためお勧めしません。

source: Although any length of text can be stored in each field of a ListView, only the first 260 characters are displayed.
ja: リストビューの各フィールドには任意の長さのテキストを格納することができますが、最初の260文字だけが表示されます。

source: Although any length of text can be stored in each item of a TreeView, only the first 260 characters are displayed.
ja: TreeViewの各項目には任意の長さのテキストを格納できるが、表示されるのは最初の260文字だけである。

source: Although any single character can be used as a key name, its meaning (scan code or virtual keycode) depends on the current keyboard layout.
ja: 任意の 1 文字をキー名として使用できますが、その意味（スキャン コードまたは仮想キーコード）は現在のキーボードレイアウトによって異なります。

source: Although blocks can be used anywhere, currently they are only meaningful when used with function definitions, If, Else, Loop statements, Try, Catch or Finally.
ja: ブロックはどこでも使えますが、現状では関数定義、If、Else、Loop文、Try、Catch、Finallyで使う場合にのみ意味を持ちます。

source: Although by convention a library file generally contains only a single function or class of the same name as its filename, it may also contain private functions that are called only by it.
ja: 通常、ライブラリ・ファイルには、ファイル名と同じ名前の関数やクラスが1つだけ含まれるのが通例だが、そのファイルによってのみ呼び出されるプライベート関数が含まれることもある。

source: Although checking the Type string is generally faster, the type of a value can be tested by checking whether it has a given base.
ja: Type文字列をチェックする方が一般的に速いが、値の型は、それが指定されたベースを持っているかどうかをチェックすることによってテストすることができる。

source: Although color depths as low as 8-bit (256-color) are supported, the fast mode performs much better in 24-bit or 32-bit color.
ja: 8ビット（256色）までの色深度に対応していますが、高速モードは24ビットまたは32ビットカラーでより優れた性能を発揮します。

source: Although hotstrings are mainly used to expand abbreviations as you type them (auto-replace), they can also be used to launch any scripted action.
ja: ホットストリングは、主に略語を入力しながら展開する（自動置換）ために使用されますが、任意のスクリプトアクションを起動するためにも使用することができます。

source: Although indentation makes code easier to read, in AutoHotkey it does not affect the grouping of statements.
ja: インデントはコードを読みやすくしますが、AutoHotkeyではステートメントのグループ化には影響しません。

source: Although it is certainly possible that the file has been infected, most often these alerts are false positives, meaning that the antivirus program is mistaken.
ja: 確かにそのファイルが感染している可能性はありますが、多くの場合、これらの警告はウイルス対策プログラムが勘違いしていることを意味する偽陽性です。

source: Although it is generally quite fast, SendText still has to send each character one at a time, while Send generally needs to send at least twice as many messages (key-down and key-up).
ja: 一般的にかなり高速ですが、SendTextはまだ各文字を一度に送信する必要があり、Sendは一般的に少なくとも2倍のメッセージ（キーダウン・キーアップ）を送信する必要があります。

source: Although it is traditional for all viewing modes except Icon and Tile to show small icons, this can be overridden by passing a large-icon list to the SetImageList method and specifying 1 (small-icon) for the second parameter.
ja: アイコンとタイルを除くすべての表示モードでは、小さなアイコンを表示するのが伝統的ですが、SetImageListメソッドに大きなアイコンリストを渡し、第2パラメータに1（小さなアイコン）を指定することでこれをオーバーライドすることができます。

source: Although it isn't valid to use Params* just anywhere, it can be used in an array literal ([A, B, C, ArrayToAppend*]) or property parameter list (Alpha.Beta[Params*] or Alpha[Params*]).
ja: Params*はどこでも使えるわけではありませんが、配列リテラル（[A, B, C, ArrayToAppend*]）やプロパティのパラメータリスト（Alpha.Beta[Params*]やAlpha[Params*]）で使用することが可能です。

source: Although larger values can be contained within a string, any attempt to convert the string to a number (such as by using it in a math operation) will cause it to be similarly truncated.
ja: 文字列の中に大きな値を含めることができますが、文字列を数値に変換しようとすると（数学の演算で使用するなど）、同様に切り捨てられます。

source: Although memory used by the object is reclaimed by the operating system when the program exits, __Delete will not be called unless all references to the object are freed.
ja: オブジェクトが使用していたメモリは、プログラムが終了するときにオペレーティング・システムによって回収されますが、オブジェクトへのすべての参照が解放されない限り、__Deleteは呼び出されません。

source: Although modified keys such as Alt+C (!c) are not supported, non-alphanumeric characters such as ?!:@&{} by default require the Shift key to be pressed or not pressed depending on how the character is normally typed.
ja: Alt+C（！c）のような修飾キーはサポートされていませんが、デフォルトで?!:@&{}のような非英数字文字は、通常の文字の入力方法に応じて、Shiftキーを押すか押さないかを決定します。

source: Although not as convenient as using the last found window, the window's ID can be stored in a variable so that the script can refer to it by a name of your choice, even if the title changes.
ja: 最後に見つかったウィンドウのように便利ではありませんが、ウィンドウのIDを変数に格納することで、タイトルが変わってもスクリプトが任意の名前で参照することができます。

source: Although not as flexible, hotstrings are generally easier to use.
ja: 柔軟性には欠けるが、一般的にホットストリングは使いやすいです。

source: Although not exactly equivalent to a for-loop, the following demonstrates this process:
ja: forループと厳密に同じではありませんが、以下のようにこの処理を実演しています：

source: Although only years between 1601 and 9999 are supported, a formatted time can still be produced for earlier years as long as the time portion is valid.
ja: 1601年から9999年までの年号のみがサポートされていますが、時刻部分が有効である限り、それ以前の年号でもフォーマットされた時刻を作成することができます。
